# AI Computer Use - APT System Packages
# Ubuntu 24.04 Noble Numbat

# Build essentials
build-essential
gcc
g++
gcc-13
g++-13
make
binutils
dpkg-dev
cpp
cpp-13

# Python
python3
python3-pip
python3-dev
python3-venv

# Git and version control
git
git-man

# Compression tools
zip
unzip
bzip2

# Text editors
vim
nano

# Image processing
imagemagick
libmagickwand-dev
libcairo2-dev
libpango1.0-dev
libjpeg-dev
libgif-dev
librsvg2-dev

# OCR
tesseract-ocr
tesseract-ocr-eng
tesseract-ocr-rus

# PDF processing
poppler-utils
ghostscript

# Video/Audio
ffmpeg

# Java
default-jre-headless
openjdk-21-jre-headless
ca-certificates-java

# LibreOffice
libreoffice-writer
libreoffice-calc
libreoffice-impress

# Fonts
fonts-liberation
fonts-liberation2
fonts-dejavu
fonts-dejavu-core
fonts-dejavu-extra
fonts-dejavu-mono
fonts-freefont-ttf
fonts-noto-cjk
fonts-noto-cjk-extra
fonts-noto-color-emoji
fonts-opensymbol
fonts-lmodern
fonts-gfs-baskerville
fonts-gfs-porson
fonts-ipafont-gothic
fonts-texgyre
fonts-tlwg-loma-otf
fonts-unifont
fonts-wqy-zenhei
fonts-crosextra-caladea
fonts-crosextra-carlito

# Graphics
graphviz

# System libraries
libfuse3-3
dbus
dbus-daemon
ca-certificates
curl
wget
gnupg
gnupg2
apt-transport-https
file
bc

# Networking
glib-networking
glib-networking-common
glib-networking-services
